testsrc/main/mondrian/xmla/basic/RT_DSI_C_in.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis"
        SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">   
    <RequestType>${request.type}</RequestType>
    <Restrictions>
      <RestrictionList>
      </RestrictionList>
    </Restrictions>
    <Properties>
      <PropertyList>
        <DataSourceInfo>${data.source.info}</DataSourceInfo>
        <Content>${content}</Content>
      </PropertyList>
    </Properties>
    </Discover>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
